#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "ru");
    int array[10][10] = {
        {86, 40, 41, 13, 91, 96, 88, 42, 73, 51},
        {96, 23, 6, 19, 58, 80, 63, 32, 31, 1},
        {98, 86, 89, 60, 36, 95, 35, 22, 30, 82},
        {82, 99, 97, 83, 92, 52, 64, 58, 5, 53},
        {22, 77, 70, 43, 92, 86, 27, 3, 28, 51},
        {21, 7, 99, 20, 6, 62, 30, 43, 18, 34},
        {35, 80, 43, 99, 97, 71, 75, 40, 39, 89},
        {15, 43, 83, 20, 94, 33, 11, 24, 72, 85},
        {39, 77, 81, 91, 41, 9, 1, 57, 86, 45},
        {17, 69, 29, 85, 33, 69, 100, 69, 19, 75}
    };

    // Вывод исходной матрицы
    cout << "Исходная таблица:" << endl;
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }

    // Сложение элементов по вертикали
    for (int i = 1; i < 10; i++)
    {
        array[i][0] += array[i - 1][0];
    }

    // Сложение элементов по горизонтали
    for (int j = 1; j < 10; j++)
    {
        array[0][j] += array[0][j - 1];
    }

    // Сложение элементов по диагонали
    for (int i = 1; i < 10; i++)
    {
        for (int j = 1; j < 10; j++)
        {
            int minElement = min(array[i][j - 1], array[i - 1][j]);
            array[i][j] += minElement;
        }
    }

    // Вывод измененной матрицы
    cout << endl << "Измененная таблица:" << endl;
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }

    return 0;
}